#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # yandex_api_gateway.ai-radio-static-gateway will be created
  + resource "yandex_api_gateway" "ai-radio-static-gateway" {
      + created_at        = (known after apply)
      + domain            = (known after apply)
      + execution_timeout = "30"
      + folder_id         = "b1g2inpl68al98r9ock7"
      + id                = (known after apply)
      + log_group_id      = (known after apply)
      + name              = "ai-radio-static-gateway"
      + spec              = (known after apply)
      + status            = (known after apply)
      + user_domains      = (known after apply)

      + connectivity {
          + network_id = (known after apply)
        }

      + custom_domains {
          + certificate_id = "fpq4064mdcgk44edhopp"
          + domain_id      = (known after apply)
          + fqdn           = "ai-radio.ru"
        }
    }

  # yandex_compute_disk.ai-radio-caster-disk will be created
  + resource "yandex_compute_disk" "ai-radio-caster-disk" {
      + block_size  = 4096
      + created_at  = (known after apply)
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + image_id    = "fd86idv7gmqapoeiq5ld"
      + name        = "ai-radio-caster-disk"
      + product_ids = (known after apply)
      + size        = 10
      + status      = (known after apply)
      + type        = "network-ssd"
      + zone        = "ru-central1-d"

      + disk_placement_policy (known after apply)

      + hardware_generation (known after apply)
    }

  # yandex_compute_instance.ai-radio-caster-vm will be created
  + resource "yandex_compute_instance" "ai-radio-caster-vm" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys"  = "valter:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIBEeS0amjIkd8k43ROrW63C8i7GqZy8xQlsQKOZuDgxJ valter@valtet-lenovo"
          + "user-data" = <<-EOT
                #cloud-config
                datasource:
                  Ec2:
                    strict_id: false
                ssh_pwauth: no
                users:
                - name: valter
                  sudo: 'ALL=(ALL) NOPASSWD:ALL'
                  shell: /bin/bash
                  ssh_authorized_keys:
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIBEeS0amjIkd8k43ROrW63C8i7GqZy8xQlsQKOZuDgxJ valter@valtet-lenovo
                runcmd: []
            EOT
        }
      + name                      = "ai-radio-caster-vm"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-d"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params (known after apply)
        }

      + metadata_options (known after apply)

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy (known after apply)

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy (known after apply)
    }

  # yandex_container_registry.ai-radio-registry will be created
  + resource "yandex_container_registry" "ai-radio-registry" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + name       = "ai-radio-registry"
      + status     = (known after apply)
    }

  # yandex_container_registry_iam_binding.puller will be created
  + resource "yandex_container_registry_iam_binding" "puller" {
      + id          = (known after apply)
      + members     = [
          + "system:group:organization:bpf7g9i7n7ntnksbdvlr:users",
        ]
      + registry_id = (known after apply)
      + role        = "container-registry.images.puller"
    }

  # yandex_container_repository.ai-radio-caster will be created
  + resource "yandex_container_repository" "ai-radio-caster" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # yandex_dns_recordset.ai-radio-aname-1 will be created
  + resource "yandex_dns_recordset" "ai-radio-aname-1" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 600
      + type    = "ANAME"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai-radio-aname-2 will be created
  + resource "yandex_dns_recordset" "ai-radio-aname-2" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "www.ai-radio.ru."
      + ttl     = 600
      + type    = "ANAME"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.ai-radio-txt-1 will be created
  + resource "yandex_dns_recordset" "ai-radio-txt-1" {
      + data    = [
          + "_globalsign-domain-verification=BnGJeP9SYFsqs0D2V5N2AVirW5IouTlYZ2CUcFqxuQ",
        ]
      + id      = (known after apply)
      + name    = "@"
      + ttl     = 600
      + type    = "TXT"
      + zone_id = (known after apply)
    }

  # yandex_dns_zone.ai-radio-zone will be created
  + resource "yandex_dns_zone" "ai-radio-zone" {
      + created_at          = (known after apply)
      + deletion_protection = true
      + description         = "dns zone"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "ai-radio-zone"
      + private_networks    = (known after apply)
      + public              = true
      + zone                = "ai-radio.ru."
    }

  # yandex_iam_service_account.ai-radio-base-sa will be created
  + resource "yandex_iam_service_account" "ai-radio-base-sa" {
      + created_at  = (known after apply)
      + description = "Basic service account for ai-radio"
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "ai-radio-base-sa"
    }

  # yandex_iam_service_account_static_access_key.ai-radio-static-key will be created
  + resource "yandex_iam_service_account_static_access_key" "ai-radio-static-key" {
      + access_key                   = (known after apply)
      + created_at                   = (known after apply)
      + encrypted_secret_key         = (known after apply)
      + id                           = (known after apply)
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + secret_key                   = (sensitive value)
      + service_account_id           = (known after apply)
    }

  # yandex_resourcemanager_folder_iam_member.ai-radio-base-sa-gw-editor will be created
  + resource "yandex_resourcemanager_folder_iam_member" "ai-radio-base-sa-gw-editor" {
      + folder_id = "b1g2inpl68al98r9ock7"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "api-gateway.editor"
    }

  # yandex_resourcemanager_folder_iam_member.ai-radio-base-sa-storage-editor will be created
  + resource "yandex_resourcemanager_folder_iam_member" "ai-radio-base-sa-storage-editor" {
      + folder_id = "b1g2inpl68al98r9ock7"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "storage.editor"
    }

  # yandex_storage_bucket.ai-radio-images-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-images-bucket" {
      + access_key            = (known after apply)
      + bucket                = "ai-radio-images"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = "b1g2inpl68al98r9ock7"
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_storage_bucket.ai-radio-music-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-music-bucket" {
      + access_key            = (known after apply)
      + bucket                = "ai-radio-music"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = "b1g2inpl68al98r9ock7"
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_storage_bucket.ai-radio-website-bucket will be created
  + resource "yandex_storage_bucket" "ai-radio-website-bucket" {
      + access_key            = (known after apply)
      + bucket                = "ai-radio-website"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = "b1g2inpl68al98r9ock7"
      + force_destroy         = false
      + id                    = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + versioning (known after apply)
    }

  # yandex_vpc_default_security_group.default_sg will be created
  + resource "yandex_vpc_default_security_group" "default_sg" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = (known after apply)
      + network_id = (known after apply)
      + status     = (known after apply)

      + egress {
          + description       = "To internet"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "Communication inside this SG"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "ICMP"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ICMP"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "NLB health check"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "RDP"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 3389
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "from gw"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "TCP"
          + to_port           = 80
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "ssh"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 22
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # yandex_vpc_gateway.ai-radio-egress_gateway will be created
  + resource "yandex_vpc_gateway" "ai-radio-egress_gateway" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "ai-radio-egress-gateway"

      + shared_egress_gateway {}
    }

  # yandex_vpc_network.ai-radio-network will be created
  + resource "yandex_vpc_network" "ai-radio-network" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = "b1g2inpl68al98r9ock7"
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "ai-radio-network"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_route_table.ai-radio-route-table will be created
  + resource "yandex_vpc_route_table" "ai-radio-route-table" {
      + created_at = (known after apply)
      + folder_id  = "b1g2inpl68al98r9ock7"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "ai-radio-route-table"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # yandex_vpc_subnet.ai-radio-private-subnet-1 will be created
  + resource "yandex_vpc_subnet" "ai-radio-private-subnet-1" {
      + created_at     = (known after apply)
      + folder_id      = "b1g2inpl68al98r9ock7"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "ai-radio-private-subnet-1"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.5.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"
    }

  # yandex_vpc_subnet.ai-radio-private-subnet-2 will be created
  + resource "yandex_vpc_subnet" "ai-radio-private-subnet-2" {
      + created_at     = (known after apply)
      + folder_id      = "b1g2inpl68al98r9ock7"
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "ai-radio-private-subnet-2"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.15.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ai-radio-base-sa-id             = (known after apply)
  + ai-radio-caster-repository-name = (known after apply)
  + ai-radio-images-bucket-name     = "ai-radio-images"
  + ai-radio-website-bucket-name    = "ai-radio-website"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @valeter, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Yandex Cloud Integration check`*